<template>
  <div>
    <div class="box">
      <h3>第一章总 则</h3>
      <p>第一条 </p>
      <span>为了更好地服务投资者，北京创金启富投资管理有限公司（以下简称“本公司”）在线上交易系统内（包括但不限于官方网站、手机客户端、手机微信端，下同）推出基金约定交易，为了保护投资者利益，特根据相应法律法规制定本规则。在线上交易过程中涉及的投资者、本公司、相关基金管理公司、相关托管机构及其他与基金约定有关的机构（相关基金管理公司、相关托管机构及其他与基金约定有关的机构下统称基金约定交易业务其他相关机构方）皆应遵守本规则。 本规则所指投资者是指通过北京创金启富投资管理有限公司线上交易系统内进行基金约定交易的投资者。
        </span>
      <h3>第二章约定交易定义</h3>
      <p>第二条</p>
      <span>约定交易，指投资者通过线上交易系统预先设定基金约定交易计划，当条件满足后进行约定交易委托的一种交易方式。 约定交易目前支持包括但不限于基金约定申购、基金约定转换和基金约定赎回业务，下统称基金约定交易。
        </span>
      <h3>第三章约定交易业务规则</h3>
      <p>第三条</p>
      <span>基金约定交易系统是指线上交易系统预先设定好根据模型信号进行基金约定交易的条件，在实际交易日提出基金约定交易申请并实际完成交易；基金约定交易有效期内的基金约定交易无需投资者再次确认。</span>
      <p>第四条</p>
      <span>系统根据约定交易设定条件生成交易申请，投资者需要在充分阅读并理解本规则基础上，对约定交易产生的投资结果负责。投资者参与约定交易时，初次默认有效期为一年。在约定交易有效期内，约定交易条件满足后，系统依照约定交易规则发起交易申请，该约定交易计划执行到约定有效期截止日；如在基金约定交易的有效期内，基金约定交易条件不能满足，基金约定交易申请不发起。投资者有在基金约定交易有效期内自行退出基金约定交易的权利，但为了保证投资者利益，基金约定交易过程中如果有基金约定交易申请未被确认，则投资者不能在基金约定交易申请确认前自行退出基金约定交易或撤销未确认基金约定交易申请。</span>
      <p>第五条</p>
      <span>基金约定交易业务遵循“未知价”和“金额申购、份额赎回”的原则。约定交易业务中所涉及到的基金约定交易基金净值以约定交易实际交易发生日的基金单位份额净值为准，计算方式同普通基金交易业务一致；基金约定交易业务过程涉及的基金约定交易相关费用请参考产品页详细介绍，实际费用以基金公司计算为准。</span>
      <p>第六条</p>
      <span>基金约定交易开始时，系统将根据约定交易持仓为投资者提出当前约定交易计划持有基金的申购申请操作。</span>
      <p>第七条</p>
      <span>基金约定申购交易指投资者基金约定交易条件，当某个交易日条件符合时则进行相应的基金转换申请的操作。基金约定转换交易指投资者基金约定交易条件，当某个交易日条件符合时则进行相应的基金转换申请的操作。基金约定赎回交易指投资者基金约定交易条件，当某个交易日条件符合时则进行相应的基金赎回申请的操作。为了保护基金投资者利益，北京创金启富投资管理有限公司可以增加或是减少基金约定交易种类。</span>
      <p>第八条</p>
      <span>基金约定日可以为基金约定转换计划有效期内中的任意交易日，当满足基金约定交易条件时，系统按照约定交易规则进行基金约定交易相关委托申请，并在实际交易日完成交易，基金约定交易过程无需投资者再次确认。</span>
      <h3>第四章约定事项</h3>
      <p>第九条</p>
      <span>本公司对基金约定交易申请的受理并不代表该申请一定成功，而仅代表本公司确实接收到该申请。申请的确认以基金注册登记机构或基金管理人的最终确认结果为准。因投资者账户余额不足、账户状态不正常等投资者自身原因或网络故障、系统故障等不可抗力导致约定计划实际交易日无法交易成功的情况下，该笔约定交易申请将不予顺延执行，本次约定交易申请失效。如投资者个人出现包括但不限于银行卡存在挂失、损坏、销卡等异常情况下，请优先处理相关问题，投资者未及时对相关问题采取必要措施所产生的一切后果，由该投资者自行承担，与北京创金启富投资管理有限公司以及基金约定交易其他相关机构方无关。</span>
      <p>第十条</p>
      <span>基金约定交易是根据模型信号发出日（T-1日）的情况来判断，并在约定交易实际交易发生日（T日）完成交易，客户须充分知晓并自行承担约定交易实际交易日当天存在的市场风险。</span>
      <p>第十一条</p>
      <span>如基金约定交易实际交易发生日触发相关基金巨额赎回，依据基金管理人对巨额赎回处理的规则，可能将该约定交易申请进行比例确认。</span>
      <h3>第五章附则</h3>
      <p>第十二条</p>
      <span>投资者应该确保参与本公司基金约定交易的资金来源合法，投资者投资意愿真实有效，未受非自身以外因素强迫。</span>
      <p>第十三条</p>
      <span>为了基金约定交易更好的保护投资者利益，本公司可根据约定交易业务发展情况，对本规则做出必要的修订，本规则修订发布之日起生效。北京创金启富投资管理有限公司在中华人民共和国相关法律法规允许的情况下拥有本规定最终解释权。</span>
    </div>
  </div>
</template>

<script>
  import {Tab, TabItem, Group, Cell, XButton, Sticky, Scroller, Divider, Spinner} from 'vux'

  export default {
    components: {
      Tab,
      TabItem,
      Group,
      Cell,
      XButton,
      Sticky,
      Scroller,
      Divider,
      Spinner
    },
    data () {
      return {
        value: 'test'
      }
    },
    methods: {},
    mounted () {

    }
  }
</script>

<style lang="less" scoped>
  @import '~vux/src/styles/1px.less';
  @import '~vux/src/styles/center.less';
  @import '../styles/custom.less';

  .box h2 {
    font-size: 18px;
    color: #000000;
    text-align: center;
    margin-bottom: 10px;
  }

  .box h3 {
    font-size: 16px;
    color: #222222;
    margin-top: 10px;
    margin-bottom: 10px;
  }

  .box p {
    font-size: 14px;
    color: #666666;
    line-height: 2;
  }

  .box span {
    font-size: 14px;
    display: block;
    color: #666666;
    text-indent: 1em;
    line-height: 2;
  }

  .box {
    padding: 15px;
  }
</style>
